Repository: thonny/thonny
Catalog: thonny/locale/*/LC_MESSAGES/thonny.po
Languages: id_id, it_it, zh_cn

source: Manage packages for %s
id_id: Kelola paket untuk %s
it_it: Gestisci i pacchetti per %s
zh_cn: 管理%s包

source: Confirmation
id_id: Konfirmasi
it_it: Conferma
zh_cn: 确认

source: Looks like you are installing a Thonny-related package. If you meant to install a Thonny plugin, then you should choose 'Tools → Manage plugins...' instead Are you sure you want to install %s for the back-end?
id_id: Sepertinya Anda sedang menginstal paket yang terkait dengan Thonny. Jika maksud Anda adalah menginstal plugin Thonny, maka sebaiknya Anda memilih 'Alat → Kelola plugin...' Apakah Anda yakin ingin menginstal %s untuk backend?
it_it: Sembra che tu stia installando un pacchetto relativo a Thonny. Se intendevi installare un plugin Thonny, allora dovresti scegliere invece 'Strumenti → Gestisci plugin...' Sei sicuro di voler installare %s per il back-end?
zh_cn: 您似乎正在安装与Thonny相关的软件包。 如果您想安装Thonny的插件，你应该 选择“工具→管理插件...” 您是否确定要在后台安装%s？

source: NB! There may be another version available which is compatible with current Thonny version. Click on '...' button to choose the version to install.
id_id: Catatan! Mungkin ada versi lain yang kompatibel dengan Thonny saat ini. Klik tombol '...' untuk memilih versi yang akan diinstal.
it_it: NB! Potrebbe essere disponibile un'altra versione compatibile con l'attuale versione di Thonny. Clicca sul pulsante '...' per scegliere la versione da installare.
zh_cn: 注意！可能还有其他版本可供安装，该版本与当前版本的Thonny兼容。单击“...”按钮来选择要安装的版本。

source: Thonny plugin without requirements
id_id: Plugin Thonny tanpa dependensi
it_it: Plugin Thonny senza requisiti
zh_cn: 没有依赖项的Thonny插件

source: Unsuitable requirements
id_id: Persyaratan tidak cocok
it_it: Requisiti non idonei
zh_cn: 不匹配的依赖项

source: This package requires different Thonny version:
id_id: Paket ini memerlukan versi Thonny yang berbeda:
it_it: Questo pacchetto richiede una versione diversa di Thonny:
zh_cn: 此软件包需要其它版本的Thonny：

source: If you still want it, then please install it from the command line.
id_id: Jika Anda tetap menginginkannya, silakan instal melalui command line.
it_it: Se lo desideri ancora, installalo dalla riga di comando.
zh_cn: 如果您仍然需要安装，请从命令行进行安装。

source: NB! You need to restart Thonny after installing / upgrading / uninstalling a plug-in.
id_id: Catatan! Anda perlu memulai ulang Thonny setelah menginstal / memperbarui / menghapus plugin.
it_it: NB! Devi riavviare Thonny dopo aver installato/aggiornato/disinstallato un plug-in.
zh_cn: 注意！安装/升级/卸载插件后，您需要重新启动Thonny。

source: Thonny plug-ins
id_id: Plugin Thonny
it_it: Plug-in di Thonny
zh_cn: Thonny插件

source: Advanced install / upgrade / downgrade
id_id: Instalasi / pembaruan / penurunan versi lanjutan
it_it: Installazione avanzata/aggiornamento/ritorno alla versione precedente
zh_cn: 高级 安装/升级/降级

source: Desired version
id_id: Versi yang diinginkan
it_it: Versione desiderata
zh_cn: 需要的版本

source: Upgrade dependencies
id_id: Perbarui dependensi
it_it: Aggiorna le dipendenze
zh_cn: 升级依赖项

source: Requires:
id_id: Membutuhkan:
it_it: Richiede:
zh_cn: 依赖项:

source: Error:
id_id: Kesalahan:
it_it: Errore:
zh_cn: 错误：

source: Manage packages...
id_id: Kelola paket...
it_it: Gestisci pacchetti...
zh_cn: 管理包...

source: Manage plug-ins...
id_id: Kelola plugin...
it_it: Gestisci i plug-in...
zh_cn: 管理插件...

source: Open replayer...
id_id: Buka pemutar ulang...
it_it: Apri replayer...
zh_cn: 打开replayer

source: Change working directory to script directory on Run / Debug
id_id: Ubah direktori kerja ke direktori skrip saat Menjalankan / Debugging
it_it: Cambia la directory di lavoro nella directory degli script mentre Esegui/Debug
zh_cn: 在运行/调试时将工作目录更改为脚本目录

source: Show function calls (frames) in separate windows
id_id: Tampilkan panggilan fungsi (frame) di jendela terpisah
it_it: Mostra le chiamate alle funzioni (frames) in finestre separate
zh_cn: 在单独的窗口中显示函数调用（帧）

source: Uncheck if you want more traditional experience.
id_id: Hapus centang jika Anda menginginkan pengalaman yang lebih tradisional.
it_it: Deseleziona se desideri un'esperienza più tradizionale.
zh_cn: 取消勾选以启用经典操作界面

source: Open and close Stack view automatically
id_id: Buka dan tutup tampilan Stack secara otomatis
it_it: Apri e chiudi la vista Stack automaticamente
zh_cn: 自动打开和关闭堆栈视图

source: Opens the Stack view on first call and closes it when program returns to main frame.
id_id: Membuka tampilan Stack pada panggilan pertama dan menutupnya ketika program kembali ke frame utama.
it_it: Apre la vista Stack alla prima chiamata e la chiude quando il programma ritorna al frame principale.
zh_cn: 第一次调用时打开堆栈视图，当程序返回主程序时关闭它。

source: Allow stepping into libraries (ie. outside of main script directory)
id_id: Izinkan memasuki pustaka (misalnya di luar direktori skrip utama)
it_it: Consenti l'accesso alle librerie (ad es. al di fuori della directory principale degli script)
zh_cn: 允许步入库文件（即除主脚本目录外的其他库文件）

source: May make debugging slower.
id_id: Mungkin memperlambat proses debugging.
it_it: Può rallentare il debug.
zh_cn: 可能会使调试变慢。

source: Preferred debugger
id_id: Debugger yang diinginkan
it_it: Debug preferito
zh_cn: 首选调试器

source: (used when clicking Debug toolbar button)
id_id: (digunakan saat mengklik tombol toolbar Debug)
it_it: (usato quando si clicca il bottone Debug nella barra degli strumenti)
zh_cn: （在点击工具栏的调试按钮后使用）

source: Birdseye port
id_id: Port Birdseye
it_it: Porta di Birdseye
zh_cn: Birdseye端口

source: (restart Thonny after changing this)
id_id: (restart Thonny setelah mengubah ini)
it_it: (riavvia Thonny dopo aver cambiato questo)
zh_cn: (改变此项后需要重启Thonny)

source: Run & Debug
id_id: Jalankan & Debug
it_it: Esegui & Debug
zh_cn: 运行和调试

source: Terminal emulation
id_id: Emulasi terminal
it_it: Emulazione di terminale
zh_cn: 终端仿真

source: supports basic ANSI-colors and styles
id_id: mendukung warna dan gaya ANSI dasar
it_it: supporta i colori e gli stili ANSI di base
zh_cn: 支持基本的ANSI颜色和样式

source: Maximum number of lines to keep.
id_id: Jumlah maksimum baris yang akan disimpan.
it_it: Numero massimo di linee da mantenere.
zh_cn: 可保存的最大行数

source: NB! Large values may cause poor performance!
id_id: NB! Nilai besar dapat menyebabkan kinerja buruk!
it_it: NB! Valori elevati possono causare scarse prestazioni!
zh_cn: 注意！较大的值可能会导致性能不佳！

source: Maximum length of line fragments before squeezing
id_id: Panjang maksimum fragmen baris sebelum dipadatkan
it_it: Lunghezza massima dei frammenti di linea prima della compressione
zh_cn: 行允许的最大长度，超出后将压缩

source: Running current script in terminal
id_id: Menjalankan skrip saat ini di terminal
it_it: Esecuzione dello script corrente nel terminale
zh_cn: 在终端运行此脚本

source: Present Python REPL after program ends
id_id: Tampilkan Python REPL setelah program berakhir
it_it: Presenta Python REPL al termine del programma
zh_cn: 在程序结束执行后启动当前的Python REPL

source: Keep terminal window open after Python process ends
id_id: Biarkan jendela terminal terbuka setelah proses Python berakhir
it_it: Mantieni aperta la finestra del terminale al termine del processo Python
zh_cn: Python进程结束后，保持终端窗口打开

source: NB! Automatic closing needs to be enabled in Terminal's settings (Profiles → Shell → When the shell exits)
id_id: NB! Penutupan otomatis perlu diaktifkan dalam pengaturan Terminal (Profil → Shell → Ketika shell keluar)
it_it: NB! La chiusura automatica deve essere abilitata nelle impostazioni del Terminale (Profili → Shell → Quando termina la shell)
zh_cn: 注意！自动关闭需要在终端的设置中启用 （Profiles → Shell → 当Shell退出时）

source: Terminal
it_it: Terminale
zh_cn: 终端

source: UI theme
id_id: Tema UI
it_it: Tema UI
zh_cn: UI主题

source: Syntax theme
id_id: Tema sintaksis
it_it: Tema della sintassi
zh_cn: 语法主题

source: Editor font
id_id: Font editor
it_it: Carattere dell'editor
zh_cn: 编辑器字体

source: IO font
id_id: Font IO
it_it: Carattere di IO
zh_cn: IO 字体

source: Preview
id_id: Pratinjau
it_it: Anteprima
zh_cn: 预览

source: This is a comment
id_id: Ini adalah komentar
it_it: Questo è un commento
zh_cn: 这是一个注释

source: The answer is
id_id: Jawaban adalah
it_it: La risposta è
zh_cn: 答案为

source: blah, blah
id_id: bla, bla
it_it: bla, bla
zh_cn: 无边落木萧萧下，不尽长江滚滚来

source: NB! Some style elements change only after restarting Thonny!
id_id: NB! Beberapa elemen gaya hanya berubah setelah merestart Thonny!
it_it: NB! Alcuni elementi dello stile cambiano solo dopo aver riavviato Thonny!
zh_cn: 注意！一些风格、样式等的改变只有在重启Thonny后才生效！

source: Enter an integer
id_id: Masukkan angka bulat
it_it: Inserisci un intero
zh_cn: 请输入一个整数

source: Theme & Font
id_id: Tema & Font
it_it: Temi & Font
zh_cn: 主题&字体

source: Open Thonny program folder...
id_id: Buka folder program Thonny...
it_it: Apri la cartella di programma di Thonny...
zh_cn: 打开Thonny安装目录...

source: Open Thonny data folder...
id_id: Buka folder data Thonny...
it_it: Apri la cartella dei dati di Thonny...
zh_cn: 打开Thonny数据目录...

source: Home
id_id: Beranda
zh_cn: 主页

source: Help contents
id_id: Isi Bantuan
it_it: Contenuti dell'aiuto
zh_cn: 帮助内容

source: CircuitPython device
id_id: Perangkat CircuitPython
it_it: Dispositivo CircuitPython
zh_cn: CircuitPython设备

source: MicroPython device
id_id: Perangkat MicroPython
it_it: Dispositivo MicroPython
zh_cn: MicroPython设备

source: Connect your device to the computer and select corresponding port below
id_id: Hubungkan perangkatmu ke komputer dan pilih port yang sesuai di bawah ini
it_it: Collega il dispositivo al computer e seleziona la porta corrispondente qui sotto
zh_cn: 将您的设备连接到计算机，并在下面选择相应的端口

source: look for your device name, "USB Serial" or "UART"
id_id: cari nama perangkatmu, "USB Serial" atau "UART"
it_it: cerca il nome del dispositivo, "USB Serial" o "UART"
zh_cn: 查找你的设备名字，"USB Serial"或"UART"

source: If you can't find it, you may need to install proper USB driver first.
id_id: Jika kamu tidak menemukannya, mungkin kamu perlu menginstal driver USB yang sesuai terlebih dahulu.
it_it: Se non riesci a trovarlo potresti aver bisgno di installare un driver USB adatto.
zh_cn: 如果您找不到它，您可能需要先安装适当的USB驱动程序。

source: Port
it_it: Porta
zh_cn: 端口

source: Try to detect port automatically
id_id: Coba deteksi port secara otomatis
it_it: Prova a determinare la porta automaticamente
zh_cn: 自动探测端口

source: MicroPython (generic)
id_id: MicroPython (umum)
it_it: MicroPython (generico)
zh_cn: MicroPython (通用)

source: Print...
id_id: Cetak...
it_it: Stampa...
zh_cn: 打印...

source: Open system shell...
id_id: Buka shell sistem...
it_it: Apri shell di sistema...
zh_cn: 打开系统 Shell...

source: Details
id_id: Detail
it_it: Dettagli
zh_cn: 详细信息

source: Install from requirements file
id_id: Pasang dari file requirements
it_it: Installa dal file requirements
zh_cn: 从requirements文件中安装

source: Install from local file
id_id: Pasang dari file lokal
it_it: Installa da file locale
zh_cn: 从本地文件中安装

source: This dialog is for managing Thonny plug-ins and their dependencies. If you want to install packages for your own programs then choose 'Tools → Manage packages...'
id_id: Dialog ini untuk mengelola plugin Thonny dan dependensinya. Jika Anda ingin menginstal paket untuk program Anda sendiri, pilih 'Alat → Kelola paket...'
it_it: Questa finestra di dialogo serve per gestire i plug-in Thonny e le loro dipendenze. Se vuoi installare i pacchetti per i tuoi programmi, scegli 'Strumenti → Gestisci i pacchetti...'
zh_cn: 此对话框用于管理Thonny的插件及其依赖项。 如果您想为您自己的程序安装软件包，请选择“工具”→“管理软件包...”

source: CircuitPython (generic)
id_id: CircuitPython (umum)
it_it: CircuitPython (generico)
zh_cn: CircuitPython (通用)

source: Indent selected lines
id_id: Indentasi baris yang dipilih
it_it: Indenta le linee selezionate
zh_cn: 缩进选择的行

source: Dedent selected lines
id_id: Hapus indentasi pada baris yang dipilih
it_it: Deindenta le linee selezionate
zh_cn: 反缩进选择的行

source: Switch to regular mode
id_id: Beralih ke mode biasa
it_it: Passa alla modalità regolare
zh_cn: 切换至一般模式

source: Make sure MicroPython has been installed to your micro:bit.
id_id: Pastikan MicroPython telah terinstal di micro:bit Anda.
it_it: Assicurati che MicroPython sia stato installato sul micro:bit.
zh_cn: 确认MicroPython已经安装到你的micro:bit上了。

source: Don't forget that main.py only works without embedded main script.
id_id: Jangan lupa bahwa main.py hanya berfungsi tanpa skrip utama yang tersemat.
it_it: Non dimenticare che main.py funziona solo senza lo script principale incorporato.
zh_cn: 注意 main.py 仅在没有嵌入式主脚本的情况下才能运行。

source: Could not find disk '%s'. Do you want to locate it yourself?
id_id: Tidak dapat menemukan disk '%s'. Apakah Anda ingin mencarikannya sendiri?
it_it: Impossibile trovare il disco '%s'. Vuoi localizzarlo tu stesso?
zh_cn: 无法找到磁盘 '%s', 你要手动定位它吗?

source: Found several '%s' disks. Do you want to choose one yourself?
id_id: Tidak dapat menemukan disk '%s'. Apakah Anda ingin mencarikannya sendiri?
it_it: Impossibile trovare il disco '%s'. Vuoi localizzarlo tu stesso?
zh_cn: 找到多个 '%s' 磁盘, 你想自己选择一个吗?

source: Can't find suitable disk
id_id: Tidak dapat menemukan disk yang sesuai
it_it: Impossibile trovare un disco adatto
zh_cn: 无法找到合适的磁盘

source: %d items
it_it: %d elementi
zh_cn: %d 项

source: Move to Trash
id_id: Pindahkan ke Sampah
it_it: Sposta nel Cestino
zh_cn: 移动到回收站

source: Delete
id_id: Hapus
it_it: Elimina
zh_cn: 删除

source: New directory
id_id: Direktori baru
it_it: Nuova cartella
zh_cn: 新建文件夹

source: Properties
id_id: Properti
it_it: Proprietà
zh_cn: 属性

source: Storage space
id_id: Ruang penyimpanan
it_it: Spazio di archiviazione
zh_cn: 存储空间

source: Path
id_id: Jalur
it_it: Percorso
zh_cn: 路径

source: Directory properties
id_id: Properti direktori
it_it: Proprietà della cartella
zh_cn: 文件夹属性

source: File properties
id_id: Properti file
it_it: Proprietà del file
zh_cn: 文件属性

source: bytes
zh_cn: 字节

source: Size
id_id: Ukuran
it_it: Grandezza
zh_cn: 大小

source: Modified
id_id: Dimodifikasi
it_it: Modificato
zh_cn: 修改时间

source: Deleting %s
id_id: Menghapus %s
it_it: Eliminazione di %s
zh_cn: 删除 %s

source: Loading
id_id: Memuat
it_it: Sto caricando
zh_cn: 加载中

source: Saving
id_id: Menyimpan
it_it: Sto salvando
zh_cn: 保存中

source: Upload to %s
id_id: Unggah ke %s
it_it: Carica in %s
zh_cn: 上传到 %s

source: Downloading %s to %s
id_id: Mengunduh %s ke %s
it_it: Sto scaricando %s in %s
zh_cn: 下载 %s 到 %s

source: Download to %s
id_id: Unduh ke %s
it_it: Scarica in %s
zh_cn: 下载到 %s

source: Open in system file manager
id_id: Buka di pengelola file sistem
it_it: Apri nel file manager di sistema
zh_cn: 打开系统文件管理器

source: Hide hidden files
id_id: Sembunyikan file tersembunyi
it_it: Nascondi i file nascosti
zh_cn: 不显示隐藏文件

source: Show hidden files
id_id: Tampilkan file tersembunyi
it_it: Mostra i file nascosti
zh_cn: 显示隐藏文件

source: Open in Thonny
id_id: Buka di Thonny
it_it: Apri in Thonny
zh_cn: 使用 Thonny 打开

source: Open in system default app
id_id: Buka di aplikasi bawaan sistem
it_it: Apri nell'app di sistema predefinita
zh_cn: 使用系统默认应用打开

source: Configure %s files
id_id: Konfigurasi file %s
it_it: Configura %s file
zh_cn: 配置 %s 文件

source: What to do with a %s file when you double-click it in Thonny's file browser?
id_id: Apa yang harus dilakukan dengan file %s saat Anda mengklik dua-kali di browser file Thonny?
it_it: Cosa fare con un file %s quando fai doppio clic su di esso nel browser di file di Thonny?
zh_cn: 在 Thonny 文件浏览里双击 %s 文件时, 要执行什么?

source: Deleting
id_id: Menghapus
it_it: Eliminazione
zh_cn: 正在删除

source: Creating directory
id_id: Membuat direktori
it_it: Creazione directory
zh_cn: 正在创建文件夹

source: Loading %s
id_id: Memuat %s
it_it: Caricamento %s
zh_cn: 加载 %s

source: Saving to %s
id_id: Menyimpan ke %s
it_it: Salvataggio in %s
zh_cn: 正在保存到 %s

source: Save All files
id_id: Simpan semua file
it_it: Salva tutti i file
zh_cn: 保存全部文件

source: Configure interpreter...
id_id: Konfigurasi interpreter...
it_it: Configura l'interprete...
zh_cn: 配置解释器

source: Device
id_id: Perangkat
it_it: Dispotivo
zh_cn: 设备

source: Cancelling
id_id: Membatalkan
it_it: Annullamento
zh_cn: 正在取消

source: Starting
id_id: Memulai
it_it: Avviamento
zh_cn: 正在启动

source: Authentication
id_id: Autentikasi
it_it: Autenticazione
zh_cn: 验证

source: Enter the passphrase of your private key for {}
id_id: Masukkan kata sandi untuk kunci privat Anda untuk {}
it_it: Inserisci la passphrase della tua chiave privata per {}
zh_cn: 输入 {} 的私钥

source: Enter your password for {}
id_id: Masukkan kata sandi Anda untuk {}
it_it: Inserisci la password per {}
zh_cn: 输入 {} 的密码

source: The representation above is an approximate value of this float. The exact stored value is %s which is about %s
id_id: Representasi di atas adalah nilai perkiraan dari float ini. Nilai sebenarnyayang disimpan adalah %s, yang kira-kira sama dengan %s
it_it: La rappresentazione sopra è un valore approssimativo di questo float. Il valore esatto memorizzato è %s che è circa %s
zh_cn: 以上值是一个浮点的近似值。确切的存储值是 %s ，大约为 %s

source: Search results
id_id: Hasil pencarian
it_it: Risultati della ricerca
zh_cn: 搜索结果

source: Searching
id_id: Mencari
it_it: Ricerca in corso
zh_cn: 搜索中

source: Installing '%s'
id_id: Menginstal '%s'
it_it: Installazione di '%s'
zh_cn: 安装 '%s'

source: Upgrading '%s'
id_id: Memperbarui '%s'
it_it: Aggiornamento di '%s'
zh_cn: 升级 '%s'

source: Uninstalling '%s'
id_id: Menghapus instalasi '%s'
it_it: Disinstallazione di '%s'
zh_cn: 卸载 '%s'

source: Installing
id_id: Menginstal
it_it: Installazione
zh_cn: 正在安装

source: Package manager is not available for this interpreter
id_id: Manajer paket tidak tersedia untuk interpreter ini
it_it: Il gestore dei pacchetti non è disponibile per questo interprete
zh_cn: 此解释器的包管理无法使用

source: Not supported
id_id: Tidak didukung
it_it: Non supportato
zh_cn: 不支持

source: Not available
id_id: Tidak tersedia
it_it: Non disponibile
zh_cn: 不可用

source: You need to stop your program before launching the package manager.
id_id: Anda perlu menghentikan program Anda sebelum meluncurkan manajer paket.
it_it: È necessario arrestare il programma prima di avviare il gestore pacchetti.
zh_cn: 启动包管理之前你需要停止你的应用。

source: Open evaluated values in Object inspector
id_id: Buka nilai yang dievaluasi di Inspector Objek
it_it: Apri i valori valutati nell'Analizzatore di oggetti
zh_cn: 在对象检查器打开评估值

source: Python executable
id_id: Eksekutabel Python
it_it: Eseguibile Python
zh_cn: Python可执行程序

source: NB! File selection button may not work properly when selecting executables from a virtual environment. In this case choose the 'activate' script instead of the interpreter (or enter the path directly to the box)!
id_id: NB! Tombol pemilihan file mungkin tidak berfungsi dengan baik saat memilih eksekutabel dari lingkungan virtual. Dalam hal ini pilih skrip 'activate' sebagai ganti interpreter (atau masukkan path langsung ke kotak)!
it_it: NB! Il pulsante di selezione dei file potrebbe non funzionare correttamente quando si selezionano gli eseguibili da un ambiente virtuale. In questo caso scegli invece lo script 'activate' dell'interprete (o inserisci il percorso direttamente al box)!
zh_cn: 注意! 当从虚拟环境中选择可执行文件时文件选择按钮可能会无效, 此时你需要选择 active 脚本来代替它解释器(或者直接输入解释器的路径)!

source: Remote Python 3 (SSH)
id_id: Python 3 Jarak Jauh (SSH)
it_it: Python 3 remoto (SSH)
zh_cn: 远程 Python 3 (SSH)

source: Not connected
id_id: Tidak terhubung
it_it: Non connesso
zh_cn: 无法连接

source: MicroPython (local)
id_id: MicroPython (lokal)
it_it: MicroPython (locale)
zh_cn: MicroPython (本地)

source: no absolute lib directory in sys.path
id_id: tidak ada direktori lib absolut di sys.path
it_it: nessuna directory lib assoluta in sys.path
zh_cn: sys.path中没有绝对库目录

source: Search on PyPI
id_id: Cari di PyPI
it_it: Cerca in PyPI
zh_cn: 在PyPI上搜索

source: Open in Thonny's text editor
id_id: Buka di editor teks Thonny
it_it: Apri nell'editor di testo di Thonny
zh_cn: 用 Thonny 打开

source: Storage space on this drive or filesystem
id_id: Ruang penyimpanan pada drive atau sistem berkas ini
it_it: Spazio di archiviazione su questa unità o file system
zh_cn: 磁盘或文件系统上的存储空间

source: total space
id_id: total ruang
it_it: spazio totale
zh_cn: 总空间

source: used space
id_id: ruang terpakai
it_it: spazio usato
zh_cn: 已使用

source: free space
id_id: ruang kosong
it_it: spazio libero
zh_cn: 剩余

source: Storage info
id_id: Informasi penyimpanan
it_it: Info sull'archiviazione
zh_cn: 存储信息

source: Replace tabs with spaces
id_id: Ganti tab dengan spasi
it_it: Sostituisci le tabulazioni con gli spazi
zh_cn: 使用空格替换制表符

source: Highlight tab characters
id_id: Sorot karakter tab
it_it: Evidenzia i caratteri di tabulazione
zh_cn: 高亮显示制表符

source: Indent with tab characters (not recommended for Python)
id_id: Indentasi dengan karakter tab (tidak disarankan untuk Python)
it_it: Indentazione con caratteri di tabulazione (non raccomandato con Python)
zh_cn: 使用制表符来缩进（不推荐用于Python代码）

source: Name
id_id: Nama
it_it: Nome
zh_cn: 名称

source: Size (bytes)
id_id: Ukuran
it_it: Dimensione (byte)
zh_cn: 大小(字节)

source: Enter name for new directory under %s
id_id: Masukkan nama untuk direktori baru di bawah %s
it_it: Inserisci il nome per la nuova directory in %s
zh_cn: 输入在 %s 目录下的新文件夹名

source: Nothing selected
id_id: Tidak ada yang dipilih
it_it: Niente di selezionato
zh_cn: 未选择

source: Select an item and try again!
id_id: Pilih item dan coba lagi!
it_it: Seleziona un elemento e riprova!
zh_cn: 选择一项然后重试!

source: Open from %s
id_id: Buka dari %s
it_it: Apri da %s
zh_cn: 打开自 %s

source: Save to %s
id_id: Simpan ke %s
it_it: Salva in %s
zh_cn: 保存到 %s

source: File name:
id_id: Nama file:
it_it: Nome del file:
zh_cn: 文件名:

source: Value ID
id_id: ID Nilai
it_it: ID valore
zh_cn: 值 ID

source: Value
id_id: Nilai
it_it: Valore
zh_cn: 值

source: Save password
id_id: Simpan kata sandi
it_it: Salva password
zh_cn: 保存密码

source: Function call at %s
id_id: Pemanggilan fungsi di %s
it_it: Chiamata di funzione a %s
zh_cn: 在 %s 函数调用

source: Local variables
id_id: Variabel lokal
it_it: Variabili locali
zh_cn: 局部变量

source: Function
id_id: Fungsi
it_it: Funzione
zh_cn: 函数

source: Location
id_id: Lokasi
it_it: Posizione
zh_cn: 位置

source: If last command raised an exception then this view will show the stacktrace.
id_id: Jika perintah terakhir menghasilkan exception, tampilan ini akan menunjukkan jejak eksekusi (stacktrace).
it_it: Se l'ultimo comando ha generato un'eccezione, questa vista mostrerà lo stacktrace.
zh_cn: 如果上一个命令出现异常, 此视图会显示堆栈信息。

source: Data
it_it: Dati
zh_cn: 数据

source: Attributes
id_id: Atribut
it_it: Attributi
zh_cn: 属性

source: Index
id_id: Indeks
it_it: Indice
zh_cn: 索引

source: Key ID
id_id: ID Kunci
it_it: ID chiave
zh_cn: 键 ID

source: Key
id_id: Kunci
it_it: Chiave
zh_cn: 键

source: Back to %s
id_id: Kembali ke %s
it_it: Torna a %s
zh_cn: 回到 %s

source: Port or WebREPL
id_id: Port atau WebREPL
it_it: Porta o WebREPL
zh_cn: 端口或 WebREPL

source: Password
id_id: Kata sandi
zh_cn: 密码

source: Source code
id_id: Kode sumber
it_it: Codice sorgente
zh_cn: 源码

source: Use Tk file dialogs instead of Zenity
id_id: Gunakan dialog file Tk alih-alih Zenity
it_it: Usa le finestre di dialogo di Tk invece di Zenity
zh_cn: 使用 Tk 文件对话框代替 Zenity

source: Select if the file dialogs end up behind the main window
id_id: Pilih jika dialog file muncul di belakang jendela utama
it_it: Seleziona se i file di dialogo vanno dietro la finestra principale
zh_cn: 选择它如果你的文件对话框一直出现在主窗口下层

source: Environment variables (one KEY=VALUE per line)
id_id: Variabel lingkungan (satu KEY=VALUE per baris)
it_it: Variabili d'ambiente (una CHIAVE=VALORE per riga)
zh_cn: 环境变量(每行一个 KEY=VALUE )

source: New file
id_id: File baru
it_it: Nuovo file
zh_cn: 新建文件

source: Rename
id_id: Ganti nama
it_it: Rinomina
zh_cn: 重命名

source: Rename '%s'
id_id: Ganti nama '%s'
it_it: Rinomina '%s'
zh_cn: 重命名 '%s'

source: Enter new name
id_id: Masukkan nama baru
it_it: Inserisci un nuovo nome
zh_cn: 输入新名称

source: Paste failed
id_id: Gagal menempel
it_it: Impossibile incollare
zh_cn: 粘贴失败
