Repository: thonny/thonny
Catalog: thonny/locale/*/LC_MESSAGES/thonny.po
Languages: id_id, it_it, zh_cn

source: File
id_id: Berkas
zh_cn: 文件

source: Edit
it_it: Modifica
zh_cn: 编辑

source: View
id_id: Tampilan
it_it: Visualizza
zh_cn: 视图

source: Run
id_id: Jalankan
it_it: Esegui
zh_cn: 运行

source: Tools
id_id: Alat
it_it: Strumenti
zh_cn: 工具

source: Help
id_id: Bantuan
it_it: Aiuto
zh_cn: 帮助

source: Exit
id_id: Keluar
it_it: Esci
zh_cn: 退出

source: Decrease font size
id_id: Perkecil ukuran font
it_it: Diminuisci la dimensione del carattere
zh_cn: 缩小字体

source: Focus editor
id_id: Fokus ke editor
it_it: Vai all'editor
zh_cn: 切换到编辑器

source: Focus shell
id_id: Fokus ke shell
it_it: Vai alla shell
zh_cn: 切换到Shell

source: Maximize view
id_id: Maksimalkan tampilan
it_it: Vista massimizzata
zh_cn: 最大化查看

source: Full screen
id_id: Layar penuh
it_it: Schermo intero
zh_cn: 全屏

source: Program arguments
id_id: Argumen program
it_it: Argomenti del programma
zh_cn: 程序参数

source: About Thonny
id_id: Tentang Thonny
it_it: Informazioni su Thonny
zh_cn: 关于Thonny

source: Made in University of Tartu, Estonia, with the help from open-source community, Raspberry Pi Foundation and Cybernetica AS
id_id: Dibuat di Universitas Tartu, Estonia, dengan bantuan dari komunitas open-source, Raspberry Pi Foundation dan Cybernetica AS
it_it: Creato presso Università di Tartu, Estonia, con l'aiuto della comunità open source, Fondazione Raspberry Pi e Cibernetica AS
zh_cn: 编写于: 爱沙尼亚,塔尔图大学. 帮助者: 开源社区,树莓派基金会 和Cybernetica AS

source: This program comes with ABSOLUTELY NO WARRANTY! It is free software, and you are welcome to redistribute it under certain conditions, see https://opensource.org/licenses/MIT for details
id_id: Program ini tidak memberikan GARANSI APA PUN! Ini adalah perangkat lunak gratis, dan Anda dipersilakan untuk mendistribusikannya ulang dalam kondisi tertentu, lihat https://opensource.org/licenses/MIT untuk detailnya
it_it: Questo programma viene fornito ASSOLUTAMENTE SENZA GARANZIA! È un software gratuito e sei il benvenuto a ridistribuirlo a determinate condizioni, vedi https://opensource.org/licenses/MIT per i dettagli
zh_cn: 此软件绝不担保! 此软件是自由软件! 你也可以在特定的条款下分发它,详细请查看 https://opensource.org/licenses/MIT

source: Version history
id_id: Riwayat versi
it_it: Cronologia delle versioni
zh_cn: 历史版本

source: Report problems
id_id: Laporkan masalah
it_it: Segnalazione di problemi
zh_cn: 反馈问题

source: Open Assistant automatically when program crashes with an exception
id_id: Buka Asisten secara otomatis saat program mengalami crash karena exception
it_it: Apri automaticamente l'Assistente quando il programma si arresta in modo anomalo con un'eccezione
zh_cn: 当程序因异常而奔溃时自动打开助手功能

source: Open Assistant automatically when it has warnings for your code
id_id: Buka Asisten secara otomatis saat ada peringatan terhadap kode Anda
it_it: Apri automaticamente l'Assistente quando ha avvisi per il codice
zh_cn: 当代码有警告时自动打开助手功能

source: Perform selected Pylint checks
id_id: Lakukan pemeriksaan Pylint yang dipilih
it_it: Esegui i controlli Pylint selezionati
zh_cn: 执行选定的 Pylint 检查

source: Perform MyPy checks
id_id: Lakukan pemeriksaan MyPy
it_it: Esegui i controlli MyPy
zh_cn: 执行 MyPy 检查

source: Disabled checks (one id per line)
id_id: Pemeriksaan yang dinonaktifkan (satu ID per baris)
it_it: Controlli disabilitati (un id per riga)
zh_cn: 禁用检查 (每行一个 id )

source: Assistant
id_id: Assisten
it_it: Assistente
zh_cn: 助手

source: Auto-complete
id_id: Lengkap otomatis
it_it: Auto-completamento
zh_cn: 自动补全

source: Interpreter
it_it: Interprete
zh_cn: 解释器

source: About Birdseye
id_id: Tentang Birdseye
it_it: Informazioni su Birdseye
zh_cn: 关于 Birdseye

source: Birdseye is a Python debugger which needs to be installed separately. Do you want to open the help page and learn more?
id_id: Birdseye adalah debugger Python yang perlu diinstal secara terpisah. Apakah Anda ingin membuka halaman bantuan dan mempelajarinya lebih lanjut?
it_it: Birdseye è un debugger Python che deve essere installato separatamente. Vuoi aprire la pagina di aiuto e saperne di più?
zh_cn: Birdseye 是一个需要独立安装的Python调试器。 你想打开帮助页以了解更多信息吗?

source: Debug current script (birdseye)
id_id: Debug skrip saat ini (birdseye)
it_it: Esegui il debug dello script corrente (birdseye)
zh_cn: 调试当前脚本 (birdseye)

source: Toggle comment
id_id: Nyalakan komentar
it_it: Attiva commenti
zh_cn: 注释⇋代码

source: Comment out
id_id: Komentari
it_it: Commenta
zh_cn: 注释代码

source: Uncomment
id_id: Hapus komentar
it_it: Decommenta
zh_cn: 取消注释

source: Undo
id_id: Urungkan
it_it: Annulla
zh_cn: 撤销

source: Redo
id_id: Ulangi
zh_cn: 重做

source: Cut
id_id: Potong
it_it: Taglia
zh_cn: 剪切

source: Copy
id_id: Salin
it_it: Copia
zh_cn: 复制

source: Paste
id_id: Tempel
it_it: Incolla
zh_cn: 粘贴

source: Select all
id_id: Pilih semua
it_it: Seleziona tutto
zh_cn: 全选

source: Run to cursor
id_id: Jalankan hingga kursor
it_it: Esegui fino al cursore
zh_cn: 运行至光标处

source: Can't close yet
id_id: Belum bisa ditutup
it_it: Impossibile chiudere
zh_cn: 无法关闭

source: Use "Stop" command if you want to cancel debugging
id_id: Gunakan perintah "Stop" jika ingin membatalkan debugging
it_it: Usa il comando "Stop" per annullare il debugging
zh_cn: 如果你想停止调试，请使用"停止"指令

source: Dock user windows
id_id: Jendela pengguna yang ditambatkan
it_it: Ancora le finestre dell'utente
zh_cn: 停靠用户窗口

source: Highlight matching names
id_id: Sorot nama yang cocok
it_it: Evidenzia i nomi che corrispondono
zh_cn: 高亮匹配名称

source: Highlight local variables
id_id: Sorot variabel lokal
it_it: Evidenzia le variabili locali
zh_cn: 用斜体显示局部变量

source: Highlight parentheses
id_id: Sorot tanda kurung
it_it: Evidenzia le parentesi
zh_cn: 高亮显示括号

source: Highlight syntax elements
id_id: Sorot elemen sintaks
it_it: Evidenzia gli elementi di sintassi
zh_cn: 高亮显示语法元素

source: Highlight current line (requires reopening the editor)
id_id: Sorot baris saat ini (perlu membuka ulang editor)
it_it: Evidenzia la riga corrente (richeide il riavvio dell'editor)
zh_cn: 高亮显示当前行(需要重启编辑器)

source: Show line numbers
id_id: Tampilkan nomor baris
it_it: Mostra i numeri di riga
zh_cn: 显示行号

source: Recommended maximum line length (Set to 0 to turn off margin line)
id_id: Panjang baris maksimum yang disarankan (Atur ke 0 untuk menonaktifkan garis batas)
it_it: Lunghezza massima consigliata della linea (0 per disattivare la linea di margine)
zh_cn: 建议最大代码长度(0表示关闭边界线)

source: Editor
zh_cn: 编辑器

source: Export usage logs...
id_id: Ekspor log penggunaan...
it_it: Esporta registri di utilizzo...
zh_cn: 导出使用日志...

source: Events
id_id: Peristiwa
it_it: Eventi
zh_cn: 事件

source: Files
id_id: Berkas
it_it: File
zh_cn: 文件

source: Find & Replace
id_id: Cari & Ganti
it_it: Trova e sostituisci
zh_cn: 查找和替换

source: Find:
id_id: Cari:
it_it: Trova:
zh_cn: 查找:

source: Replace with:
id_id: Ganti dengan:
it_it: Sostituisci con:
zh_cn: 替换为:

source: Case sensitive
id_id: Peka huruf besar/kecil
it_it: MAIUSCOLO/minuscolo
zh_cn: 区分大小写

source: Up
id_id: Atas
it_it: Su
zh_cn: 向上

source: Down
id_id: Bawah
it_it: Giù
zh_cn: 向下

source: Find
id_id: Cari
it_it: Trova
zh_cn: 查找

source: Replace
id_id: Gantikan
it_it: Sostituisci
zh_cn: 替换

source: Replace+Find
id_id: Gantikan+Cari
it_it: Sostituisci e trova
zh_cn: 替换 + 查找

source: Replace all
id_id: Gantikan semua
it_it: Sostituisci tutto
zh_cn: 全部替换

source: Enter string to be replaced.
id_id: Masukkan teks (string) yang akan digantikan.
it_it: Immetti la stringa da sostituire.
zh_cn: 输入要替换的字符串.

source: The specified text was not found!
id_id: Teks yang dimaksud tidak ditemukan!
it_it: Il testo specificato non è stato trovato!
zh_cn: 找不到要替换的文字!

source: Allow only single Thonny instance
id_id: Izinkan hanya satu instansi Thonny
it_it: Consenti solo una singola istanza di Thonny
zh_cn: 只允许同时运行一个Thonny实例

source: Reopen all files from previous session
id_id: Buka kembali semua file dari sesi sebelumnya
it_it: Riapri tutti i file dalla sessione precedente
zh_cn: 重新打开上一个会话中的所有文件

source: Disable notification sound
id_id: Nonaktifkan suara notifikasi
it_it: Disabilita i suoni di notifica
zh_cn: 禁用通知声

source: Font scaling mode
id_id: Mode skala huruf
it_it: Modalità di ridimensionamento del font
zh_cn: 字体缩放模式

source: Heap mode is on. Close Heap view to turn it off.
id_id: Mode Heap aktif. Tutup tampilan Heap untuk menonaktifkannya.
it_it: La modalità Heap è attiva. Chiudi la scheda Heap per disattivarla.
zh_cn: 堆模式已开启. 在视图中可关闭.

source: Heap
zh_cn: 堆

source: Language
id_id: Bahasa
it_it: Lingua
zh_cn: 界面语言

source: This box is meant for your working notes -- assignment instructions, code snippets, whatever. Everything will be saved automatically and loaded when you open Thonny next time. Feel free to delete this text to make room for your own notes.
id_id: Kotak ini ditujukan untuk catatan kerja Anda — instruksi tugas, potongan kode, dan lainnya. Semua akan disimpan secara otomatis dan dimuat saat Anda membuka Thonny lagi nanti. Silakan hapus teks ini untuk memberikan ruang bagi catatan Anda sendiri.
it_it: Questo riquadro serve per le tue note di lavoro -- istruzioni di assegnazione, frammenti di codice, qualunque cosa. Il tutto verrà salvato automaticamente e caricato quando aprirai Thonny la prossima volta. Sentiti libero di cancellare questo testo per fare spazio alle tue note.
zh_cn: 这里可以记录你的工作笔记 -- 任务说明，代码片段，等等。 所有内容都会被自动保存，并且下次打开 Thonny 时也会被自动加载。 您可以随意删除此文本，好为自己的笔记腾出空间。

source: Notes
id_id: Catatan
it_it: Note
zh_cn: 笔记

source: Previous object
id_id: Objek sebelumnya
it_it: Oggetto precedente
zh_cn: 上一个对象

source: Next object
id_id: Objek berikutnya
it_it: Oggetto successivo
zh_cn: 下一个对象

source: Object inspector
id_id: Pemeriksa objek
it_it: Analizzatore di oggetti
zh_cn: 对象检查器

source: Outline
id_id: Garis besar
it_it: Struttura
zh_cn: 大纲

source: Pygame Zero mode
id_id: Mode Pygame Zero
it_it: Modalità Pygame Zero
zh_cn: Pygame Zero 模式

source: Uninstall
id_id: Hapus
it_it: Disinstalla
zh_cn: 卸载

source: Close
id_id: Tutup
it_it: Chiudi
zh_cn: 关闭

source: Click
id_id: Klik
it_it: Clicca
zh_cn: 点击

source: here
id_id: di sini
it_it: qui
zh_cn: 这里

source: Upgrade
id_id: Perbarui
it_it: Aggiorna
zh_cn: 升级

source: Install
id_id: Pasang
it_it: Installa
zh_cn: 安装

source: Could not find the package from PyPI.
id_id: Tidak dapat menemukan paket dari PyPI.
it_it: Impossibile trovare il pacchetto da PyPI.
zh_cn: 在 PyPI 上没有找到此包。

source: Latest stable version
id_id: Versi stabil terbaru
it_it: Ultima versione stabile
zh_cn: 最新的稳定版本

source: Latest version
id_id: Versi terbaru
it_it: Ultima versione
zh_cn: 最新的版本

source: Summary
id_id: Ringkasan
it_it: Indice
zh_cn: 摘要

source: Author
id_id: Penulis
it_it: Autore
zh_cn: 作者

source: Homepage
id_id: Beranda
zh_cn: 网站主页

source: Bugtracker
id_id: Pelacak Bug
zh_cn: 问题追踪

source: Documentation
id_id: Dokumentasi
it_it: Documentazione
zh_cn: 文档

source: PyPI page
id_id: Halaman PyPI
it_it: Pagina PyPI
zh_cn: PyPI 页面

source: Requires
id_id: Membutuhkan
it_it: Richiede
zh_cn: 依赖项

source: Really uninstall?
id_id: Yakin ingin menghapus instalasi?
it_it: Vuoi veramente disinstallare?
zh_cn: 确认卸载?

source: Are you sure you want to uninstall it?
id_id: Apakah Anda yakin ingin menghapus instalasinya?
it_it: Sei sicuro di volerlo disinstallare?
zh_cn: 你确定你想要卸载吗?

source: Back to current frame
id_id: Kembali ke kerangka saat ini
it_it: Torna al riquadro attuale
zh_cn: 回到 当前 frame

source: Variables
id_id: Variabel
it_it: Variabili
zh_cn: 全局变量

source: This computer
id_id: Komputer ini
it_it: Questo computer
zh_cn: 此电脑

source: Refresh
id_id: Segarkan
it_it: Aggiorna
zh_cn: 刷新

source: Focus into
id_id: Fokus ke
it_it: Concentra su
zh_cn: 切换到

source: Error
it_it: Errore
zh_cn: 错误

source: You need to select a file!
id_id: Anda perlu memilih file!
it_it: Devi selezionare un file!
zh_cn: 你需要选择一个文件!

source: Overwrite?
id_id: Tulis ulang?
it_it: Sovrascrivere?
zh_cn: 确认覆盖?

source: Do you want to overwrite '%s' ?
id_id: Apakah Anda ingin menulis ulang '%s'?
it_it: Vuoi sovrascrivere '%s'?
zh_cn: 你想要覆盖掉'%s'?

source: New
id_id: Baru
it_it: Nuovo
zh_cn: 新建

source: Open...
id_id: Buka
it_it: Apri...
zh_cn: 打开...

source: Load
id_id: Muat
it_it: Carica
zh_cn: 加载

source: Recent files
id_id: File terbaru
it_it: File recenti
zh_cn: 最近的文件

source: Close all
id_id: Tutup semua
it_it: Chiudi tutto
zh_cn: 全部关闭

source: Save
id_id: Simpan
it_it: Salva
zh_cn: 保存

source: Save as...
id_id: Simpan sebagai...
it_it: Salva come...
zh_cn: 另存为...

source: Save copy...
id_id: Simpan salinan...
it_it: Salva una copia...
zh_cn: 保存为副本...

source: Thonny options
id_id: Opsi Thonny
it_it: Opzioni di Thonny
zh_cn: Thonny 选项

source: Run current script
id_id: Jalankan skrip saat ini
it_it: Esegui lo script corrente
zh_cn: 运行当前脚本

source: Run current script in terminal
id_id: Jalankan skrip saat ini di terminal
it_it: Esegui lo script corrente nel terminale
zh_cn: 在终端运行当前脚本

source: Stop/Restart backend
id_id: Hentikan/Mulai ulang backend
it_it: Ferma/Riavvia il backend
zh_cn: 停止/重启后端进程

source: Stop
id_id: Hentikan
it_it: Ferma
zh_cn: 停止

source: Interrupt execution
id_id: Hentikan eksekusi
it_it: Interrompi l'esecuzione
zh_cn: 中断执行

source: Send EOF / Soft reboot
id_id: Kirim EOF / Restart halus
it_it: Invia un EOF/Riavvio soft
zh_cn: 发送 EOF/软重启

source: Disconnect
id_id: Putuskan hubungan
it_it: Disconnetti
zh_cn: 断开

source: Python interpreters
id_id: Interpreter Python
it_it: Interpreti Python
zh_cn: Python解释器

source: all files
id_id: semua file
it_it: tutti i file
zh_cn: 全部文件

source: Select empty directory for new virtual environment
id_id: Pilih direktori kosong untuk lingkungan virtual baru
it_it: Seleziona una directory vuota per un nuovo ambiente virtuale
zh_cn: 为新的虚拟环境选择一个空的文件夹

source: Bad directory
id_id: Direktori buruk
it_it: Directory non valida
zh_cn: 无效的文件夹

source: Selected directory is not empty. Select another or cancel.
id_id: Direktori yang dipilih tidak kosong. Pilih yang lain atau batalkan.
it_it: La directory selezionata non è vuota. Selezionane un'altra o annulla.
zh_cn: 选择的文件夹非空， 请选择另一个或取消。

source: Creating virtual environment
id_id: Membuat lingkungan virtual
it_it: Sto creando un ambiente virtuale
zh_cn: 创建虚拟环境

source: Clear shell
id_id: Bersihkan shell
it_it: Pulisci la shell
zh_cn: 清空 Shell

source: Plotter
zh_cn: 绘图器

source: Clear
id_id: Bersihkan
it_it: Pulisci
zh_cn: 清空

source: Show Plotter
id_id: Tampilkan Plotter
it_it: Mostra il plotter
zh_cn: 显示绘图器

source: For performance reasons, Shell avoids showing very long lines in full (see Tools => Options => Shell). Here you can interact with the original text fragment.
id_id: Demi alasan kinerja, Shell menghindari menampilkan baris yang sangat panjang secara penuh(lihat Alat => Opsi => Shell). Di sini Anda dapat berinteraksi dengan potongan teks aslinya.
it_it: Per ragioni di efficienza, la shell evita di mostrare per intero righe molto lunghe (vedi Strumenti => Opzioni => Shell). Qui puoi interagire con il frammento di testo originale.
zh_cn: 出于性能原因，Shell避免完整显示很长的行(参见 工具 => 选项 => Shell)。 在这里，您可以与原始文本片段进行交互。

source: Wrap text (may be slow)
id_id: Bungkus teks (mungkin lambat)
it_it: A capo automatico (può essere lento)
zh_cn: 换行文字（可能较慢）

source: Copy to clipboard
id_id: Salin ke papan klip
it_it: Copia negli appunti
zh_cn: 复制文本到剪切板

source: Squeezed text (%d characters)
id_id: Teks terkompresi (%d karakter)
it_it: Testo schiacciato (%d caratteri)
zh_cn: 挤压文本(超 %d 个字符时)

source: Plotter visualizes series of numbers printed to the Shell.
id_id: Plotter memvisualisasikan deretan angka yang dicetak ke Shell.
it_it: Il plotter visualizza serie di numeri stampati nella Shell.
zh_cn: 绘图器可以把输出到Shell 中的一系列数字可视化。

source: See Help for details.
id_id: Lihat Bantuan untuk detail
it_it: Vedi Aiuto per i dettagli.
zh_cn: 详细信息请查看帮助。

source: Close others
id_id: Tutup lainnya
it_it: Chiudi le altre schede
zh_cn: 关闭其他

source: Copying
id_id: Menyalin
it_it: Sto copiando
zh_cn: 复制中

source: Copying %s to %s
id_id: Menyalin %s ke %s
it_it: Sto copiando %s su %s
zh_cn: 复制 %s 到 %s

source: Cancel
id_id: Batal
it_it: Annulla
zh_cn: 取消

source: OK
zh_cn: 确认

source: Select All
id_id: Pilih Semua
it_it: Seleziona tutto
zh_cn: 全选

source: Options...
id_id: Opsi...
it_it: Opzioni...
zh_cn: 选项...

source: Increase font size
id_id: Perbesar ukuran font
it_it: Aumenta la dimensione del carattere
zh_cn: 增大字体

source: Change font size
id_id: Ubah ukuran font
it_it: Cambia la dimensione del carattere
zh_cn: 改变字体大小

source: Zoom
zh_cn: 放大

source: Exit Thonny
id_id: Keluar dari Thonny
it_it: Esci da Thonny
zh_cn: 退出Thonny

source: Quit
id_id: Keluar
it_it: Chiudi
zh_cn: 退出

source: Overwriting theme '%s'
id_id: Menimpa tema '%s'
it_it: Sovrascrivi il tema '%s'
zh_cn: 覆盖主题 '%s'

source: Program arguments:
id_id: Argumen program:
it_it: Argomenti del programma:
zh_cn: 程序参数:

source: Regular mode
id_id: Mode biasa
it_it: Modalitá regolare
zh_cn: 常规模式

source: Configuration has been updated. Restart Thonny to start working in regular mode. (See 'Tools → Options → General' if you change your mind later.)
id_id: Konfigurasi telah diperbarui. Mulai ulang Thonny untuk bekerja dalam mode biasa. (Lihat 'Alat → Opsi → Umum' jika Anda berubah pikiran nanti.)
it_it: La configurazione è stata aggiornata. Riavvia Thonny per iniziare a lavorare in modalità normale. (Vedi Strumenti → Opzioni → Generale se poi cambi idea.)
zh_cn: 配置已更新。 重启Thonny并以常规模式工作。 (如果您稍后改变主意，请参阅“工具→选项→通用”。)

source: Program tree
id_id: Pohon program
it_it: Albero del programma
zh_cn: 程序树图

source: Resume
id_id: Lanjutkan
it_it: Riprendi
zh_cn: 恢复执行

source: Run / resume
id_id: Jalankan / lanjutkan
it_it: Esegui/Riprendi
zh_cn: 执行/恢复

source: Debug current script
id_id: Debug skrip saat ini
it_it: Debug dello script corrente
zh_cn: 调试当前脚本

source: Debug
zh_cn: 调试

source: Debug current script (nicer)
id_id: Debug skrip saat ini (lebih ramah)
it_it: Debug dello script corrente (più bello)
zh_cn: 调试当前脚本(nicer)

source: Debug current script (faster)
id_id: Debug skrip saat ini (lebih cepat)
it_it: Debug dello script corrente (più veloce)
zh_cn: 调试当前脚本(faster)

source: Step over
id_id: Langkahi
it_it: Passo sopra
zh_cn: 步过

source: Over
id_id: Lewati
it_it: Sopra
zh_cn: 步过

source: Step into
id_id: Melangkah ke dalam
it_it: Passo dentro
zh_cn: 步进

source: Into
id_id: Masuk
it_it: Dentro
zh_cn: 步进

source: Step out
id_id: Melangkah ke luar
it_it: Passo fuori
zh_cn: 步出

source: Out
id_id: Keluar
it_it: Fuori
zh_cn: 步出

source: Step back
id_id: Langkah mundur
it_it: Passo indietro
zh_cn: 步回

source: Back
id_id: Mundur
it_it: Indietro
zh_cn: 步回

source: Stack
id_id: Tumpukan
zh_cn: 栈

source: Exception
it_it: Eccezione
zh_cn: 异常

source: Log program usage events
id_id: Catat aktivitas penggunaan program
it_it: Registra gli eventi di utilizzo del programma
zh_cn: 记录程序执行事件日志

source: Debug mode (provides more detailed diagnostic logs)
id_id: Mode debug (menyediakan log diagnostik yang lebih rinci)
it_it: Modalità debug (fornisce informazioni diagnostiche più dettagliate)
zh_cn: 调试模式（提供更详细的诊断日志）

source: UI mode
id_id: Mode antarmuka (UI)
it_it: Modalità UI
zh_cn: UI 模式

source: UI scaling factor
id_id: Faktor skala UI
it_it: Fattore di scala UI
zh_cn: UI 缩放倍数

source: NB! Restart Thonny after changing these options!
id_id: Catatan! Mulai ulang Thonny setelah mengubah opsi-opsi ini!
it_it: NB! Riavvia Thonny dopo aver cambiato queste opzioni!
zh_cn: 注意！改变这些选项后请重启Thonny！

source: General
id_id: Umum
it_it: Generale
zh_cn: 常规

source: INSTALL
id_id: PASANG
it_it: INSTALLA
zh_cn: 安装

source: Browse the packages
id_id: Jelajahi paket-paket
it_it: Sfoglia i pacchetti
zh_cn: 浏览包

source: With current interpreter you can only browse the packages here. Use 'Tools → Open system shell...' for installing, upgrading or uninstalling.
id_id: Dengan interpreter saat ini, Anda hanya dapat menjelajahi paket di sini. Gunakan 'Alat → Buka shell sistem...' untuk memasang, memperbarui, ataumenghapus
it_it: Con l'interprete corrente puoi solo sfogliare i pacchetti qui. Utilizza 'Strumenti --> Apri la shell di sistema...' per installarli, aggiornarli o disinstallarli.
zh_cn: 在当前解释器下，您只能浏览这里的软件包。 要安装、升级或卸载软件包，请使用“工具→打开系统Shell…”命令。

source: Packages' directory
id_id: Direktori paket
it_it: Directory dei pacchetti
zh_cn: 包目录

source: Install from PyPI
id_id: Pasang dari PyPI
it_it: Installa da PyPI
zh_cn: 从PyPI安装

source: If you don't know where to get the package from, then most likely you'll want to search the Python Package Index. Start by entering the name of the package in the search box above and pressing ENTER.
id_id: Jika Anda tidak tahu dari mana mendapatkan paketnya, kemungkinan besar Anda ingin mencarinya di Python Package Index. Mulailah dengan memasukkan nama paket di kotak pencarian di atas dan tekan ENTER.
it_it: Se non sai dove prendere i pacchetti, allora dovresti cercare nell'Indice dei Pacchetti Python. Inizia inserendo il nome del pacchetto nella casella di ricerca e premi INVIO.
zh_cn: 如果您不知道从哪里获取软件包，那么您最可能需要在Python软件包索引中搜索。首先，在上面的搜索框中输入软件包的名称并按ENTER键。

source: to locate requirements.txt file and install the packages specified in it.
id_id: untuk menemukan file requirements.txt dan memasang paket-paket yang disebutkan di dalamnya.
it_it: per individuare il file requirements.txt e installare i pacchetti specificati in esso.
zh_cn: 定位requirements.txt文件并安装其中指定的包。

source: Click
id_id: Klik
it_it: Clicca
zh_cn: 点击

source: to locate and install the package file (usually with .whl, .tar.gz or .zip extension).
id_id: untuk menemukan dan memasang file paket (biasanya berekstensi .whl, .tar.gz, atau .zip).
it_it: per individuare e installare il file del pacchetto (di solito con estensione .whl, .tar.gz o .zip).
zh_cn: 定位并安装本地的包（扩展名通常为 .whl，.tar.gz 或 .zip）。

source: Upgrade or uninstall
id_id: Perbarui atau hapus
it_it: Aggiorna o installa
zh_cn: 升级或卸载

source: Start by selecting the package from the left.
id_id: Mulailah dengan memilih paket dari sebelah kiri.
it_it: Inizia selezionando il pacchetto da sinistra.
zh_cn: 首先从左边选择软件包。

source: This dialog lists all available packages, but allows upgrading and uninstalling only packages from
id_id: Dialog ini menampilkan semua paket yang tersedia, tetapi hanya memungkinkan pembaruan dan penghapusan untuk paket dari
it_it: Questa finestra di dialogo elenca tutti i pacchetti disponibili, ma consente l'aggiornamento e la disinstallazione solo dei pacchetti da
zh_cn: 此对话框列出了所有可用的软件包，但只允许对以下来源的软件包进行升级和卸载

source: New packages will be also installed into this directory. Other locations must be managed by alternative means.
id_id: Paket baru juga akan dipasang ke direktori ini. Lokasi lain harus dikelola dengan cara alternatif.
it_it: Anche i nuovi pacchetti verranno installati in questa directory. Altre sedi devono essere gestite con mezzi alternativi.
zh_cn: 新的包也将被安装到此目录中。其他位置必须通过其他方式管理。

source: Installed version:
id_id: Versi terpasang
it_it: Versione installata:
zh_cn: 已安装版本：

source: Installed to:
id_id: Dipasang ke:
it_it: Installa su:
zh_cn: 安装在：

source: Please check your spelling!
id_id: Silakan periksa ejaan Anda!
it_it: Per favore controlla lo spelling!
zh_cn: 请检查你的拼写！

source: Could not find the package info from PyPI.
id_id: Tidak dapat menemukan informasi paket dari PyPI.
it_it: Impossibile trovare le informazioni sul pacchetto da PyPI.
zh_cn: 无法从PyPI上找到此包的信息。

source: Error code:
id_id: Kode Error:
it_it: Codice di errore:
zh_cn: 错误代码：

source: Can't find package name from the list:
id_id: Tidak dapat menemukan nama paket dari daftar:
it_it: Impossibile trovare il nome del pacchetto dall'elenco:
zh_cn: 无法从这个列表中找到包的名字：

source: Package '{}' is required for installing and uninstalling other packages.
id_id: Paket '{}' diperlukan untuk menginstal dan menghapus paket lainnya.
it_it: Il pacchetto '{}' è necessario per l'installazione e la disinstallazione di altri pacchetti.
zh_cn: 在安装或卸载其他包时需要用到'{}'包。

source: Package
id_id: Paket
it_it: Pacchetto
zh_cn: 包
