Repository: thonny/thonny
Catalog: thonny/locale/*/LC_MESSAGES/thonny.po
Languages: id_id, it_it, zh_cn

source: There are conflicting folders
id_id: Ada folder yang bertabrakan
it_it: Ci sono cartelle in conflitto
zh_cn: 存在冲突的文件夹

source: File already exists
id_id: File sudah ada
it_it: Il file esiste già
zh_cn: 文件已存在

source: If it is a text file, then you can configure it to open in Thonny by right-clicking it and selecting 'Configure ... files'.
id_id: Jika ini adalah file teks, Anda dapat mengonfigurasinya untuk dibuka di Thonny dengan mengklik kanan dan memilih 'Konfigurasi ... file'.
it_it: Se si tratta di un file di testo puoi impostarne l'apertura con Thonny cliccandoci col tasto destro e selezionando 'Configura files di tipo ...'.
zh_cn: 如果这是一个文本文件，你可以右键该文件并选择“配置...文件”来设置默认用 Thonny 打开

source: Python files
id_id: File Python
it_it: File Python
zh_cn: Python 文件

source: <untitled>
id_id: <belum diberi judul>
zh_cn: <无标题>

source: File is gone
id_id: File telah hilang
it_it: Il file è sparito
zh_cn: 文件不见了

source: Do you want to also close the editor?
id_id: Apakah Anda juga ingin menutup editor?
it_it: Vuoi anche chiudere l'editor?
zh_cn: 你想关闭编辑器吗？

source: External modification
id_id: Modifikasi eksternal
it_it: Modifica esterna
zh_cn: 文件被修改

source: Do you want to discard current editor content and reload the file from disk?
id_id: Apakah Anda ingin membuang konten editor saat ini dan memuat ulang file daridisk?
it_it: Eliminare il contenuto dell'editor corrente e ricaricare il file dal disco?
zh_cn: 是否要放弃当前编辑器内容并重新加载文件？

source: Python files usually have .py extension.
id_id: File Python biasanya memiliki ekstensi .py.
it_it: I file Python di solito hanno estensione .py.
zh_cn: Python 文件通常具有 .py 扩展名。

source: Did you mean '%s'?
id_id: Apakah maksud Anda '%s'?
it_it: Intendevi '%s'?
zh_cn: 您是指 '%s' 吗？

source: Move / rename...
id_id: Pindahkan / ganti nama...
it_it: Sposta/Rinomina ...
zh_cn: 移动 / 重命名...

source: Go to line...
id_id: Pergi ke baris...
it_it: Vai alla riga...
zh_cn: 跳转到行...

source: Line number
id_id: Nomor baris
it_it: Numero di riga
zh_cn: 行号

source: Do you want to save files before closing?
id_id: Apakah Anda ingin menyimpan file sebelum menutup?
it_it: Vuoi salvare i file prima di chiudere?
zh_cn: 您想在关闭前保存文件吗？

source: Do you want to save file before closing?
id_id: Apakah Anda ingin menyimpan file sebelum menutup?
it_it: Vuoi salvare il file prima di chiudere?
zh_cn: 您想在关闭前保存文件吗？

source: Save On Close
id_id: Simpan Saat Menutup
it_it: Salva alla Chiusura
zh_cn: 关闭文件时保存

source: Command not available
id_id: Perintah tidak tersedia
it_it: Comando non disponibile
zh_cn: 命令不可用

source: This command is not available if Thonny is run via Flatpak
id_id: Perintah ini tidak tersedia jika Thonny dijalankan melalui Flatpak
it_it: Questo comando non è disponibile se Thonny è eseguito tramite Flatpak
zh_cn: 如果 Thonny 通过 Flatpak 运行，则此命令不可用

source: Support Ukraine
id_id: Dukung Ukraina
it_it: Supporta l'Ucraina
zh_cn: 支持乌克兰

source: Which kind of interpreter should Thonny use for running your code?
id_id: Jenis interpreter apa yang sebaiknya digunakan Thonny untuk menjalankan kode Anda?
it_it: Quale tipo di interprete dovrebbe usare Thonny per eseguire il codice?
zh_cn: Thonny 应该使用哪种解释器来运行您的代码？

source: Show parameter info
id_id: Tampilkan info parameter
it_it: Mostra info sui parametri
zh_cn: 显示参数信息

source: Automatically show parameter info after typing '('
id_id: Tampilkan info parameter secara otomatis setelah mengetik '('
it_it: Mostra automaticamente le info del parametro dopo aver digitato '('
zh_cn: 输入 '(' 后自动显示参数信息

source: Automatically propose completions while typing
id_id: Tawarkan pelengkapan otomatis saat mengetik
it_it: Proponi automaticamente suggerimenti durante la digitazione
zh_cn: 输入时提示自动完成

source: Automatically show documentation for completions
id_id: Tampilkan dokumentasi pelengkapan secara otomatis
it_it: Mostra automaticamente la documentazione per i suggerimenti
zh_cn: 显示自动完成提示文档

source: Request completions with Tab-key in editors
id_id: Minta pelengkapan dengan tombol Tab di editor
it_it: Richiedi suggerimenti con il tasto Tab negli editor
zh_cn: 在编辑器中使用 Tab 键自动完成

source: Request completions with Tab-key in Shell
id_id: Minta pelengkapan dengan tombol Tab di Shell
it_it: Richiedi suggerimenti con il tasto Tab nella shell
zh_cn: 在 Shell 中使用 Tab 键自动完成

source: Problem
id_id: Masalah
it_it: Problema
zh_cn: 问题

source: Could not find definition
id_id: Tidak dapat menemukan definisi
it_it: Impossibile trovare la definizione
zh_cn: 找不到定义

source: Clear Shell before starting new process (Run, Debug, Stop/Restart, ...)
id_id: Bersihkan Shell sebelum memulai proses baru (Jalankan, Debug, Hentikan/Restart, ...)
it_it: Pulisci la shell prima di iniziare un nuovo processo (Run ,Debug, Stop/Restart, ...)
zh_cn: 在启动新进程之前清空 Shell（运行、调试、停止/重新启动，...）

source: Thonny's Python
id_id: Python Thonny
it_it: Python di Thonny
zh_cn: Thonny 的 Python

source: Interrupt working program on connect
id_id: Hentikan program yang berjalan saat terhubung
it_it: Interrompi il programma quando avviene la connessione
zh_cn: 连接时中断运行中的程序

source: Synchronize device's real time clock
id_id: Sinkronkan jam waktu nyata perangkat
it_it: Sincronizza l'ora in real time del dispositivo
zh_cn: 同步设备的实时时钟

source: Use local time in real time clock
id_id: Gunakan waktu lokal di jam waktu nyata
it_it: Usa l'ora locale nell'orologio in real time
zh_cn: 在实时时钟中使用本地时间

source: Restart interpreter before running a script
id_id: Mulai ulang interpreter sebelum menjalankan skrip
it_it: Riavvia l'interprete prima di eseguire uno script
zh_cn: 运行代码前，先重启解释器

source: This doesn't look like MicroPython/CircuitPython package. Are you sure you want to install it?
id_id: Ini sepertinya bukan paket MicroPython/CircuitPython. Apakah kamu yakin ingin menginstalnya?
it_it: Questa non sembra essere una libreria di MicroPython/CircuitPython. Sei sicuro di volerla installare?
zh_cn: 这看起来不像是 MicroPython/CircuitPython 包。 您确定要安装它吗？

source: Moving to Trash
id_id: Memindahkan ke Sampah
it_it: Spostamento nel Cestino
zh_cn: 移动到回收站

source: Move %s to Trash?
id_id: Pindahkan %s ke Sampah?
it_it: Spostare %s nel Cestino?
zh_cn: 移动 %s 到回收站？

source: Moving %s to Trash
id_id: Memindahkan %s ke Sampah
it_it: Spostamento di %s nel Cestino
zh_cn: 正在移动 %s 到回收站

source: Open in default external app
id_id: Buka di aplikasi eksternal bawaan
it_it: Apri nell'app esterna predefinita
zh_cn: 在默认外部应用中打开

source: Opening remote files in external app is not supported.
id_id: Membuka file remote di aplikasi eksternal tidak didukung.
it_it: L'apertura di file remoti in applicazioni esterne non è supportata.
zh_cn: 不支持在外部应用程序中打开远程文件。

source: If the file needs to be opened in external app, then download it to a local directory and open it from there!
id_id: Jika file perlu dibuka di aplikasi eksternal, unduh terlebih dahulu ke direktori lokal dan buka dari sana!
it_it: Se il file deve essere aperto in un'app esterna, scaricalo in una directory locale e aprilo da lì!
zh_cn: 如果文件需要在外部应用程序中打开，则将其下载到本地目录并从那里打开！

source: Looks like '%s' was deleted or moved.
id_id: Sepertinya '%s' telah dihapus atau dipindahkan.
it_it: Sembra che '%s' sia stato eliminato o spostato.
zh_cn: 文件 '%s' 已被删除或移动。

source: Looks like '%s' was modified outside of the editor.
id_id: Sepertinya '%s' telah dimodifikasi di luar editor.
it_it: Sembra che '%s' sia stato modificato al di fuori dell'editor.
zh_cn: 文件 '%s' 在编辑器外被改动。

source: NB! Thonny only supports Python %s and later
id_id: NB! Thonny hanya mendukung Python %s dan versi lebih baru
it_it: NB! Thonny supporta solo Python versione %s e successive
zh_cn: 注意！Thonny 仅支持 Python %s 及更高

source: Go to line
id_id: Pergi ke baris
it_it: Vai alla riga
zh_cn: 跳转到行

source: Support
id_id: Dukungan
it_it: Supporto
zh_cn: 支持

source: Could not save
id_id: Gagal menyimpan
it_it: Impossibile salvare
zh_cn: 无法保存

source: Warning
id_id: Peringatan
it_it: Avviso
zh_cn: 警告

source: If you quote the value of an environment variable, the quotes will be part of the value. Did you intend this?
id_id: Jika Anda menambahkan tanda kutip pada nilai variabel lingkungan, tanda kutip akan menjadi bagian dari nilainya. Apakah memang itu yang Anda maksudkan?
it_it: Se inserisci le virgolette in una variabile di ambiente, le virgolette faranno parte del valore. Intendevi questo?
zh_cn: 如果您引用环境变量的值，则引号将成为该值的一部分。 你确定要这么做吗？

source: Install MicroPython
id_id: Pasang MicroPython
it_it: Installa MicroPython
zh_cn: 安装 MicroPython 解释器

source: Install CircuitPython
id_id: Pasang CircuitPython
it_it: Installa CircuitPython
zh_cn: 安装CircuitPython

source: Make uploaded shebang scripts executable
id_id: Jadikan skrip shebang yang diunggah dapat dieksekusi
it_it: Rendi eseguibili gli script shebang caricati
zh_cn: 使上传的shebang脚本可执行

source: Make saved shebang scripts executable
id_id: Buat skrip shebang yang disimpan dapat dieksekusi
it_it: Rendi eseguibili gli script shebang salvati
zh_cn: 使保存的shebang脚本可执行

source: Activate virtual environment
id_id: Aktifkan lingkungan virtual
it_it: Attiva l'ambiente virtuale
zh_cn: 激活虚拟环境

source: Target
it_it: Obbiettivo
zh_cn: 目标

source: Visualize current script at Python Tutor
id_id: Visualisasikan skrip saat ini di Python Tutor
it_it: Visualizza lo script corrente su Python Tutor
zh_cn: 在Python Tutor上可视化当前脚本

source: Line
id_id: Baris
it_it: Riga
zh_cn: 行

source: Info
zh_cn: 信息

source: No line marked with #todo found
id_id: Tidak ada baris yang ditandai dengan #todo ditemukan
it_it: Nessuna riga contrassegnata con #todo trovata
zh_cn: 找不到标有 #todo 的行

source: Install or update %s
id_id: Instal atau perbarui %s
it_it: Installa o aggiorna %s
zh_cn: 安装或更新 %s

source: Local Python 3
id_id: Python 3 Lokal
it_it: Python 3 Locale
zh_cn: 本地 Python3

source: You can activate an existing virtual environment also via the right-click context menu in the file navagation when selecting a virtual environment folder, or the 'pyveng.cfg' file inside.
id_id: Anda juga dapat mengaktifkan lingkungan virtual yang ada melalui menu konteks klik kanan pada navigasi file saat memilih folder lingkungan virtual atau file 'pyveng.cfg' di dalamnya.
it_it: È possibile attivare un ambiente virtuale esistente anche tramite il menu di scelta rapida con il tasto destro del mouse durante la navigazione dei file, quando si seleziona una cartella dell'ambiente virtuale, o il file 'pyveng.cfg' all'interno.
zh_cn: 选择虚拟环境文件夹或其中的“pyveng.cfg”时，您也可以通过文件导航中的右键单击上下文菜单来激活现有的虚拟环境。

source: Preparations (skip the VS Code part)
id_id: Persiapan (lewati bagian VS Code)
it_it: Preparazioni (salta la parte su VS Code)
zh_cn: 准备工作（跳过VS代码部分）

source: Default password
id_id: Kata sandi default
it_it: Password predefinita
zh_cn: 默认密码

source: Information
id_id: Informasi
it_it: Informazioni
zh_cn: 信息

source: For debugging the program must be saved first.
id_id: Untuk debugging, program harus disimpan terlebih dahulu.
it_it: Per eseguire il debug, il programma deve essere prima salvato.
zh_cn: 在调试程序前必须保存

source: %s doesn't look like a text file
id_id: %s tidak terlihat seperti file teks
it_it: %s non sembra un file di testo
zh_cn: %s 看起来不像是一个文本文件

source: Problem loading file
id_id: Masalah saat memuat file
it_it: Problema durante il caricamento del file
zh_cn: 加载文件时出现问题

source: This file seems to have problems with encoding. Make sure it is in UTF-8 or contains proper encoding hint.
id_id: Sepertinya file ini memiliki masalah dengan encoding Pastikan file ini menggunakan UTF-8 atau mengandung petunjuk encoding yang tepat
it_it: Questo file sembra avere problemi con la codifica. Assicurati che sia in UTF-8 o che contenga un suggerimento di codifica appropriato.
zh_cn: 这个文件似乎存在编码问题。 请确保它是UTF-8格式的，或包含正确的编码提示。

source: File is open
id_id: File sudah terbuka
it_it: Il file è aperto
zh_cn: 文件已打开

source: This file is already open in Thonny. If you want to save with this name, close the existing editor first!
id_id: File ini sudah terbuka di Thonny. Jika Anda ingin menyimpan dengan nama ini, tutup editor yang ada terlebih dahulu!
it_it: Questo file è già aperto in Thonny. Se vuoi salvare con questo nome, chiudi prima l'editor esistente!
zh_cn: 此文件已经在Thonny中打开。 如果您想以该名称保存文件，请先关闭现有的编辑器！

source: Permission Error
id_id: Kesalahan Izin
it_it: Errore di autorizzazione
zh_cn: 权限错误

source: Looks like this file or folder is not writable.
id_id: Sepertinya file atau folder ini tidak dapat ditulis
it_it: Sembra che questo file o cartella non sia scrivibile.
zh_cn: 似乎这个文件或文件夹不可写。

source: Back-end is not ready
id_id: Back-end belum siap
it_it: Il back-end non è pronto
zh_cn: 后端未就绪

source: Where to save to?
id_id: Harus menyimpan ke mana?
it_it: Dove salvare?
zh_cn: 要保存到哪个位置？

source: Potential problem
id_id: Potensi masalah
it_it: Potenziale problema
zh_cn: 潜在的问题

source: If you name your script '%s', you won't be able to import the library module named '%s'
id_id: Jika Anda memberi nama skrip Anda '%s', Anda tidak akan bisa mengimpor modul pustakadengan nama '%s'
it_it: Se chiami questo script '%s', non sarai in grado di importare il modulo della libreria chiamato '%s'
zh_cn: 如果您将脚本命名为 '%s'，则将无法导入名称为 '%s' 的库模块

source: Do you still want to use this name for your script?
id_id: Apakah Anda masih ingin menggunakan nama ini untuk skrip Anda?
it_it: Vuoi ancora usare questo nome per questo script?
zh_cn: 您仍然想要使用此名称为脚本命名吗？

source: Got permission error when trying to load %s
id_id: Terjadi kesalahan izin saat mencoba memuat %s
it_it: Errore di autorizzazione ottenuto durante il tentativo di caricare %s
zh_cn: 尝试加载如下时出现权限错误 %s

source: Try opening it with File => Open.
id_id: Cobalah membuka dengan File => Buka.
it_it: Prova ad aprirlo con File => Apri.
zh_cn: 请尝试通过 文件=>打开 来打开它。

source: Permission error
id_id: Kesalahan izin
it_it: Errore di autorizzazione
zh_cn: 权限错误

source: Allow running unnamed programs
id_id: Izinkan menjalankan program tanpa nama
it_it: Consenti l'esecuzione di programmi senza nome
zh_cn: 允许运行未命名的程序

source: License
id_id: Lisensi
it_it: Licenza
zh_cn: 授权

source: Warn if a user module shadows a library module
id_id: Peringatkan jika modul pengguna menutupi modul pustaka
it_it: Avvisa se un modulo utente oscura un modulo di libreria
zh_cn: 如果用户模块屏蔽了库模块，则发出警告

source: Search micropython-lib and PyPI
id_id: Cari di micropython-lib dan PyPI
it_it: Cerca micropython-lib e PyPI
zh_cn: 在micropython-lib和PyPI中搜索

source: unclosed_string
id_id: string_tidak_tertutup
it_it: stringa_non_chiusa

source: The packages of this interpreter can be managed via your system package manager.
id_id: Paket dari interpreter ini dapat dikelola melalui manajer paket sistem Anda.

source: For pip-installing a package, you need to use a virtual environment.
id_id: Untuk menginstal paket dengan pip, Anda perlu menggunakan lingkungan virtual.
